# vim:ft=ruby

# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "homebrew/bundle"
tap "homebrew/core"

# Applications
cask "appcleaner" # a tool to remove unused files
cask "brave-browser" # a better browser
cask "cyberduck" # a better FTP client
cask "discord" # a better chat client
cask "docker" # a better container manager
cask "dotnet-sdk" # .NET SDK
cask "firefox" # a better browser
cask "gimp" # a better image editor
cask "gitkraken" # a better git UI
cask "google-chrome" # a better browser
cask "izotope-product-portal" # a better audio editor
cask "jetbrains-toolbox" # a better IDE manager
cask "microsoft-auto-update" # a better updater
cask "microsoft-edge" # a better browser
cask "microsoft-office" # a better office suite
cask "microsoft-teams" # a better chat client
cask "obsidian" # a better note taking app
cask "postman" # a better API client
cask "powershell" # a better shell
cask "slack" # a better chat client
cask "spotify" # a better music player
cask "teamviewer" # a better remote desktop client
cask "visual-studio-code" # a better code editor
cask "wezterm" # a better terminal emulator
cask "whatsapp" # a better chat client

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-symbols-only-nerd-font"

# CLI tools
brew "azure-cli" # Azure CLI
brew "exa" # ls alternative
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "htop" # a top alternative
brew "neovim" # A better vim
brew "nvm" # Node version manager
brew "python" # python (latst)
brew "ripgrep" # grep alternative
brew "tmux" # terminal multiplexer